espressif/esp-idf/components/soc/esp32c5/register/soc/rmt_reg.h
/** RMT_CH2CONF1_REG register
 *  Configuration register 1 for channel 2
 */
#define RMT_CH2CONF1_REG (DR_REG_RMT_BASE + 0x1c)
/** RMT_RX_EN_CH2 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the receiver to start receiving data in channel 2. \\
 *  0: Disable\\
 *  1: Enable\\
 */
#define RMT_RX_EN_CH2    (BIT(0))
#define RMT_RX_EN_CH2_M  (RMT_RX_EN_CH2_V << RMT_RX_EN_CH2_S)
#define RMT_RX_EN_CH2_V  0x00000001U
#define RMT_RX_EN_CH2_S  0
/** RMT_MEM_WR_RST_CH2 : WT; bitpos: [1]; default: 0;
 *  Configures whether to reset RAM write address accessed by the receiver for channel
 *  2. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_MEM_WR_RST_CH2    (BIT(1))
#define RMT_MEM_WR_RST_CH2_M  (RMT_MEM_WR_RST_CH2_V << RMT_MEM_WR_RST_CH2_S)
#define RMT_MEM_WR_RST_CH2_V  0x00000001U
#define RMT_MEM_WR_RST_CH2_S  1
/** RMT_APB_MEM_RST_CH2 : WT; bitpos: [2]; default: 0;
 *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel 2. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_APB_MEM_RST_CH2    (BIT(2))
#define RMT_APB_MEM_RST_CH2_M  (RMT_APB_MEM_RST_CH2_V << RMT_APB_MEM_RST_CH2_S)
#define RMT_APB_MEM_RST_CH2_V  0x00000001U
#define RMT_APB_MEM_RST_CH2_S  2
/** RMT_MEM_OWNER_CH2 : R/W/SC; bitpos: [3]; default: 1;
 *  Configures the ownership of channel 2's RAM block. \\
 *  0: APB bus is using the RAM\\
 *  1: Receiver is using the RAM\\
 */
#define RMT_MEM_OWNER_CH2    (BIT(3))
#define RMT_MEM_OWNER_CH2_M  (RMT_MEM_OWNER_CH2_V << RMT_MEM_OWNER_CH2_S)
#define RMT_MEM_OWNER_CH2_V  0x00000001U
#define RMT_MEM_OWNER_CH2_S  3
/** RMT_RX_FILTER_EN_CH2 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable the receiver's filter for channel 2. \\
 *  0: Disable\\
 *  1: Enable\\
 */
#define RMT_RX_FILTER_EN_CH2    (BIT(4))
#define RMT_RX_FILTER_EN_CH2_M  (RMT_RX_FILTER_EN_CH2_V << RMT_RX_FILTER_EN_CH2_S)
#define RMT_RX_FILTER_EN_CH2_V  0x00000001U
#define RMT_RX_FILTER_EN_CH2_S  4
/** RMT_RX_FILTER_THRES_CH2 : R/W; bitpos: [12:5]; default: 15;
 *  Configures whether the receiver, when receiving data, ignores the input pulse when
 *  its width is shorter than this register value in units of rmt_sclk cycles. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_RX_FILTER_THRES_CH2    0x000000FFU
#define RMT_RX_FILTER_THRES_CH2_M  (RMT_RX_FILTER_THRES_CH2_V << RMT_RX_FILTER_THRES_CH2_S)
#define RMT_RX_FILTER_THRES_CH2_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH2_S  5
/** RMT_MEM_RX_WRAP_EN_CH2 : R/W; bitpos: [13]; default: 0;
 *  Configures whether to enable wrap RX mode for channel 2. \\
 *  0: Disable\\
 *  1: Enable\\
 *  In this mode, if the RX data size is larger than channel 2's RAM block size, the
 *  receiver stores the RX data from the first address to the last address in loops.\\
 */
#define RMT_MEM_RX_WRAP_EN_CH2    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH2_M  (RMT_MEM_RX_WRAP_EN_CH2_V << RMT_MEM_RX_WRAP_EN_CH2_S)
#define RMT_MEM_RX_WRAP_EN_CH2_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH2_S  13
/** RMT_AFIFO_RST_CH2 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_CH2    (BIT(14))
#define RMT_AFIFO_RST_CH2_M  (RMT_AFIFO_RST_CH2_V << RMT_AFIFO_RST_CH2_S)
#define RMT_AFIFO_RST_CH2_V  0x00000001U
#define RMT_AFIFO_RST_CH2_S  14
/** RMT_CONF_UPDATE_CH2 : WT; bitpos: [15]; default: 0;
 *  Synchronization bit for channel 2.
 */
#define RMT_CONF_UPDATE_CH2    (BIT(15))
#define RMT_CONF_UPDATE_CH2_M  (RMT_CONF_UPDATE_CH2_V << RMT_CONF_UPDATE_CH2_S)
#define RMT_CONF_UPDATE_CH2_V  0x00000001U
#define RMT_CONF_UPDATE_CH2_S  15

/** RMT_CH3CONF0_REG register
 *  Configuration register 0 for channel 2
 */
#define RMT_CH3CONF0_REG (DR_REG_RMT_BASE + 0x20)
/** RMT_DIV_CNT_CH3 : R/W; bitpos: [7:0]; default: 2;
 *  Configures the clock divider of channel 3. \\
 *  Measurement unit: rmt_sclk\\
 */
#define RMT_DIV_CNT_CH3    0x000000FFU
#define RMT_DIV_CNT_CH3_M  (RMT_DIV_CNT_CH3_V << RMT_DIV_CNT_CH3_S)
#define RMT_DIV_CNT_CH3_V  0x000000FFU
#define RMT_DIV_CNT_CH3_S  0
/** RMT_IDLE_THRES_CH3 : R/W; bitpos: [22:8]; default: 32767;
 *  Configures RX threshold. \\
 *  When no edge is detected on the input signal for continuous clock cycles longer
 *  than this field value, the receiver stops receiving data.\\
 *  Measurement unit: clk_div\\
 */
#define RMT_IDLE_THRES_CH3    0x00007FFFU
#define RMT_IDLE_THRES_CH3_M  (RMT_IDLE_THRES_CH3_V << RMT_IDLE_THRES_CH3_S)
#define RMT_IDLE_THRES_CH3_V  0x00007FFFU
#define RMT_IDLE_THRES_CH3_S  8
/** RMT_MEM_SIZE_CH3 : R/W; bitpos: [25:23]; default: 1;
 *  Configures the maximum number of memory blocks allocated to channel 3.
 */
#define RMT_MEM_SIZE_CH3    0x00000007U
#define RMT_MEM_SIZE_CH3_M  (RMT_MEM_SIZE_CH3_V << RMT_MEM_SIZE_CH3_S)
#define RMT_MEM_SIZE_CH3_V  0x00000007U
#define RMT_MEM_SIZE_CH3_S  23
/** RMT_CARRIER_EN_CH3 : R/W; bitpos: [28]; default: 1;
 *  Configures whether to enable carrier modulation on output signal for channel 3. \\
 *  0: Disable\\
 *  1: Enable\\
 */
#define RMT_CARRIER_EN_CH3    (BIT(28))
#define RMT_CARRIER_EN_CH3_M  (RMT_CARRIER_EN_CH3_V << RMT_CARRIER_EN_CH3_S)
#define RMT_CARRIER_EN_CH3_V  0x00000001U
#define RMT_CARRIER_EN_CH3_S  28
/** RMT_CARRIER_OUT_LV_CH3 : R/W; bitpos: [29]; default: 1;
 *  Configures the position of carrier wave for channel 3. \\
 *  0: Add carrier wave on low level\\
 *  1: Add carrier wave on high level\\
 */
#define RMT_CARRIER_OUT_LV_CH3    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH3_M  (RMT_CARRIER_OUT_LV_CH3_V << RMT_CARRIER_OUT_LV_CH3_S)
#define RMT_CARRIER_OUT_LV_CH3_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH3_S  29

/** RMT_CH3CONF1_REG register
 *  Configuration register 1 for channel 2
 */
#define RMT_CH3CONF1_REG (DR_REG_RMT_BASE + 0x24)
/** RMT_RX_EN_CH3 : R/W; bitpos: [0]; default: 0;
 *  Configures whether to enable the receiver to start receiving data in channel 3. \\
 *  0: Disable\\
 *  1: Enable\\
 */
#define RMT_RX_EN_CH3    (BIT(0))
#define RMT_RX_EN_CH3_M  (RMT_RX_EN_CH3_V << RMT_RX_EN_CH3_S)
#define RMT_RX_EN_CH3_V  0x00000001U
#define RMT_RX_EN_CH3_S  0
/** RMT_MEM_WR_RST_CH3 : WT; bitpos: [1]; default: 0;
 *  Configures whether to reset RAM write address accessed by the receiver for channel
 *  3. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_MEM_WR_RST_CH3    (BIT(1))
#define RMT_MEM_WR_RST_CH3_M  (RMT_MEM_WR_RST_CH3_V << RMT_MEM_WR_RST_CH3_S)
#define RMT_MEM_WR_RST_CH3_V  0x00000001U
#define RMT_MEM_WR_RST_CH3_S  1
/** RMT_APB_MEM_RST_CH3 : WT; bitpos: [2]; default: 0;
 *  Configures whether to reset RAM W/R address accessed by APB FIFO for channel 3. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_APB_MEM_RST_CH3    (BIT(2))
#define RMT_APB_MEM_RST_CH3_M  (RMT_APB_MEM_RST_CH3_V << RMT_APB_MEM_RST_CH3_S)
#define RMT_APB_MEM_RST_CH3_V  0x00000001U
#define RMT_APB_MEM_RST_CH3_S  2
/** RMT_MEM_OWNER_CH3 : R/W/SC; bitpos: [3]; default: 1;
 *  Configures the ownership of channel 3's RAM block. \\
 *  0: APB bus is using the RAM\\
 *  1: Receiver is using the RAM\\
 */
#define RMT_MEM_OWNER_CH3    (BIT(3))
#define RMT_MEM_OWNER_CH3_M  (RMT_MEM_OWNER_CH3_V << RMT_MEM_OWNER_CH3_S)
#define RMT_MEM_OWNER_CH3_V  0x00000001U
#define RMT_MEM_OWNER_CH3_S  3
/** RMT_RX_FILTER_EN_CH3 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable the receiver's filter for channel 3. \\
 *  0: Disable\\
 *  1: Enable\\
 */
#define RMT_RX_FILTER_EN_CH3    (BIT(4))
#define RMT_RX_FILTER_EN_CH3_M  (RMT_RX_FILTER_EN_CH3_V << RMT_RX_FILTER_EN_CH3_S)
#define RMT_RX_FILTER_EN_CH3_V  0x00000001U
#define RMT_RX_FILTER_EN_CH3_S  4
/** RMT_RX_FILTER_THRES_CH3 : R/W; bitpos: [12:5]; default: 15;
 *  Configures whether the receiver, when receiving data, ignores the input pulse when
 *  its width is shorter than this register value in units of rmt_sclk cycles. \\
 *  0: No effect\\
 *  1: Reset\\
 */
#define RMT_RX_FILTER_THRES_CH3    0x000000FFU
#define RMT_RX_FILTER_THRES_CH3_M  (RMT_RX_FILTER_THRES_CH3_V << RMT_RX_FILTER_THRES_CH3_S)
#define RMT_RX_FILTER_THRES_CH3_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH3_S  5
/** RMT_MEM_RX_WRAP_EN_CH3 : R/W; bitpos: [13]; default: 0;
 *  Configures whether to enable wrap RX mode for channel 3. \\
 *  0: Disable\\
 *  1: Enable\\
 *  In this mode, if the RX data size is larger than channel 3's RAM block size, the
 *  receiver stores the RX data from the first address to the last address in loops.\\
 */
#define RMT_MEM_RX_WRAP_EN_CH3    (BIT(13))
#define RMT_MEM_RX_WRAP_EN_CH3_M  (RMT_MEM_RX_WRAP_EN_CH3_V << RMT_MEM_RX_WRAP_EN_CH3_S)
#define RMT_MEM_RX_WRAP_EN_CH3_V  0x00000001U
#define RMT_MEM_RX_WRAP_EN_CH3_S  13
/** RMT_AFIFO_RST_CH3 : WT; bitpos: [14]; default: 0;
 *  Reserved
 */
#define RMT_AFIFO_RST_CH3    (BIT(14))
#define RMT_AFIFO_RST_CH3_M  (RMT_AFIFO_RST_CH3_V << RMT_AFIFO_RST_CH3_S)
#define RMT_AFIFO_RST_CH3_V  0x00000001U
#define RMT_AFIFO_RST_CH3_S  14
/** RMT_CONF_UPDATE_CH3 : WT; bitpos: [15]; default: 0;
 *  Synchronization bit for channel 3.
 */
#define RMT_CONF_UPDATE_CH3    (BIT(15))
#define RMT_CONF_UPDATE_CH3_M  (RMT_CONF_UPDATE_CH3_V << RMT_CONF_UPDATE_CH3_S)
#define RMT_CONF_UPDATE_CH3_V  0x00000001U
#define RMT_CONF_UPDATE_CH3_S  15

